import React from 'react'

const Chaloemkrung = () => {
  return (
    <div>
      <p>ศาลาเฉลิมกรุง</p>
      <p>ความเป็นมาของศาลาเฉลิมกรุงเริ่มขึ้นตั้งแต่ก่อนการเปลี่ยนแปลงการปกครอง เมื่อพระบาทสมเด็จพระปกเกล้าเจ้าอยู่หัว รัชกาลที่ 7 ทรงมีพระราชดำริให้จัดสร้างถาวรวัตุถุขนาดใหญ่ที่จะสามารถอำนวยประโยชน์ให้กับสาธารณชนได้เพื่อเป็นระลึกแห่งการเฉลิมฉลองที่
        กรุงเทพมหานครจะมีอายุครบ 150 ปี ในพ.ศ. 2475</p>
      <p>ศาลาเฉลิมกรุงเป็นผลงานออกแบบสถาปัตยกรรมชิ้นแรก
        ของหม่อมเจ้าสมัยเฉลิม กฤดากร </p>
      <p>ศาลาเฉลิมกรุงเปิดฉายครั้งแรกเมื่อ
        วันที่ 2 กรกฎาคม พ.ศ.2476</p>
      <p>สถาปัตยกรรม
        ในแง่ของสถาปัตยกรรมอาคารศาลาเฉลิมกรุงเป็น
        รูปแบบสากลสมัย International or Modern Style ตัวอาคารมีลักษณะเป็นรูปทรงสี่เหลี่ยมสูง
        ตระหง่าน มั่นคง ผึ่งผาย ตามสไตล์ตะวันตกในส่วน
        โครงสร้างได้นำเทคโนโลยีใหม่ของยุคนั้นมาใช้โครง
        สร้างภายในเป็นตัวรับน้ำหนักแทนการใช้ผนังและเสา ช่วยพยุงน้ำหนักแบบสถาปัตยกรรมไทย
        ด้านหน้าชั้นล่างโรงละครเป็นโถงรับรองและบนชั้นลอยมีห้องรับรองเรียกว่า “ห้องเมขลา”สามารถใช้เป็นที่รับ เสด็จและรับรองแขกพิเศษรวมทั้งจัดการแถลงข่าวได้
      </p>
      <p>เพราะความน่าเชื่อถือของตัวอาคารนี้เองจึงมีเรื่องเล่ากันว่าศาลาเฉลิมกรุงนอกจากจะเป็นโรงหนังที่ได้รับความนิยมแล้วในช่วงเวลาของสงครามโลกครั้งที่ 2 เฉลิมกรุงในวันเก่ายังเป็นที่หลบภัยทางอากาศที่ได้รับความนิยมอีกด้วยทุกครั้งเมื่อสัญญาณ หวอเตือนภัยทางอากาศดังขึ้นก็จะมีผู้คนมาหลบภัยที่ศาลาเฉลิมกรุงกันเนืองแน่นเพราะ เชื่อถือในความมั่นคงแข็งแรงของสถานที่แห่งนี้</p>
    </div>
  )
}

export default Chaloemkrung;
